num=range(10,31,2)
for x in num:
    y=x**2+3
print(y)

#Найдите сумму всех значений функции y(x) = x2 + 3 на интервале от 10 до 30 с шагом 2